Tekla Open API Reference for Tekla Structures 2025
ReinforcementPulloutElement.RotationAxis Property
 Gets or sets the rotation of the pull-out.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ReinforcementPulloutElement.Rotation RotationAxis { get; set; }
Public Property RotationAxis As ReinforcementPulloutElement.Rotation
	Get
	Set
Property Value
Type: ReinforcementPulloutElement.Rotation
See Also
Reference
ReinforcementPulloutElement Class
Tekla.Structures.Drawing Namespace